{"data":{"meetupGroup":{"events":[{"name":"BDD in Practice","local_date":"2020-01-16","local_time":"17:30","venue":{"name":"YRC Worldwide","address_1":"10990 Roe Ave.","city":"Overland Park"},"link":"https://www.meetup.com/KansasCityJUG/events/267319257/","description":"<p>Behavior-Driven Development is not just a buzz word in Kansas City. Come hear about how this technique has been applied in real-life applications right here in the KC area. Writing JUnit tests may be part of your everyday life already, but find out how using a more descriptive language and an open-source tool like Cucumber can enhance the quality and maintainability of your Java applications.</p> <p>About the Speaker:<br/>Keith Shakib has been a principal consultant in Kansas City since 2000 and has been with Keyhole Software since 2011. He came to the Kansas City area from Cary, North Carolina in 2000 after a 14 year stint at IBM where he worked in various roles including developer, product planner, manager, and architect. Projects at IBM included Information Management, C++ Class Libraries, VisualAge for Java, and the early stages of Eclipse. While consulting here in K.C. he has work worked with many different clients including Sprint, Blue Cross/Blue Shield, National Association of Insurance Commissioners (NAIC), Argus, USDA, and currently YRC Freight. Keith is passionate about helping clients write extensible, maintainable, feature-rich applications in a highly collaborative, agile development environment. Outside of work Keith enjoys the NFL and MLB as well as coaching his 11-year old son's baseball team.</p> <p>SPONSOR:<br/>Keyhole Software. Keyhole is a software development firm offering consulting, education, and custom development. Helping clients in all industries, we lead initiatives for strategic technology shifts (like modernization, microservices, and blockchain) and develop custom applications (with .NET, Java, and JavaScript). Our employee team loves technology — see our blog at <a href=\"https://KeyholeSoftware.com\" class=\"linkified\">https://KeyholeSoftware.com</a> &amp; open source tools on <a href=\"https://KeyholeLabs.com\" class=\"linkified\">https://KeyholeLabs.com</a>.</p> <p>Schedule:<br/>5:30 - 6:30 Food and social hour<br/>6:30 - 6:35 Java and group news<br/>6:35- 7:30 Main presentation<br/>After meetup - Happy hour at Top Golf</p> "}]}}}